package day6;

public class HomeworkEx1Test {

	public static void main(String[] args) {
		/* 숫자 야구게임을 구현하시오
		 * 1~9사이의 중복되지 않은 3개의 수를 랜덤으로 선택해서 해당 숫자를 맞추는 게임
		 * S = 숫자가 있고, 위치가 같은 경우
		 * B = 숫자가 있지만 위치가 다른 경우
		 * O = 일차하는 수가 하나도 없는 경우
		 * 3S 가 되면 게임이 종료
		 * 
		 * 예시
		 * 랜덤으로 생성된 숫자 : 3 9 1
		 * 입력 : 1 2 3
		 * 결과 : 2B
		 * 입력 : 4 5 6
		 * 결과 : O
		 * 입력 : 7 9 8 
		 * 결과 : 1S
		 * 입력 : 3 1 9
		 * 결과 : 1S2B
		 * 입력 : 3 9 1
		 * 결과 : 3S
		 * 정답입니다
		 */
		
		// 1. 변수선언
		// 2. 랜덤으로 세자리 숫자 정하기
			// 배열 만킁의 반복문을 돌려서 랜덤한 숫자를 생성 후 중복이 있는지 확인

	}

}
