package day9board;

public class BoardMain {

	public static void main(String[] args) {
		/* 게시판에서 게시글 관리를 위한 콘솔 프로그램을 작성하시오
		 * - 제한사항
		 * 	- 일정인원수 통제
		 *  - 작성자 이름의 동일여부 
		 *  - 게시글 조회 시 날짜가 먼저 작성자가 그 후에 오게끔 정렬
		 *  - 게시판 종료 선택 전까지 반복
		 * 1. 필요한 기능을 정리해서 메뉴로 출력
		 * - 작성자의 확인 
		 * - 게시판에 내용추가
		 * 		- 작성자	입력
		 * 		- 날짜	입력 
		 * 		- 내용	입력
		 * - 게시판에 내용수정
		 * 		- 작성자	수정
		 * 		- 날짜	수정 
		 * 		- 내용	수정
		 * - 게시판 조회
		 * 		- 날짜별 	조회
		 * 		- 작성자별	조회
		 * - 게시글 내용확인
		 * - 게시글 수 조회
		 * - 게시판 종료
		 * 2. 기능을 구현
		 * 
		 */
		
	}

}
